In [3]:
import pandas as pd

In [4]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

In [11]:
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [16]:
right_table = {'CountryID': [3,4],
              'Country': ['Pandama', 'Spain']}

In [28]:
right_table_df = pd.DataFrame(right_table)
right_table_df

   ID  Country
0   3  Pandama
1   4    Spain

## Inner Join

![inner join](./img/inner_join.png)

In [34]:
inner_join = left_table_df.merge(right_table_df, left_on='CountryID', right_on='ID').drop('ID',axis=1)   #Row 0, Column 1
inner_join

         Date  CountryID  Units  Country
0  03-01-2020          3     30  Pandama

In [54]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35],
               'Country':['PaK','USA','IND','IRAN']}

In [55]:
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units Country
0  01-01-2020          1     40     PaK
1  02-01-2020          1     25     USA
2  03-01-2020          3     30     IND
3  04-01-2020          2     35    IRAN

In [56]:
right_table = {'CountryID': [3,4],
              'Country': ['Pandama', 'Spain']}

In [57]:
right_table_df = pd.DataFrame(right_table)
right_table_df

   CountryID  Country
0          3  Pandama
1          4    Spain

In [58]:
inner_join = left_table_df.merge(right_table_df, left_on='CountryID', right_on='ID',suffixes=['_left','_right']).drop('ID',axis=1) 
inner_join

KeyError: 'ID'

## Left Join

![left join](./img/left_join.png)

In [74]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,4],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          4     35

In [85]:
right_table = {'ID': [3],
              'Country': ['Pandama']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID  Country
0   3  Pandama

In [86]:
left_join= left_table_df.merge(right_table_df, left_on='CountryID', right_on='ID', how='left')

In [87]:
left_join

         Date  CountryID  Units   ID  Country
0  01-01-2020          1     40  NaN      NaN
1  02-01-2020          1     25  NaN      NaN
2  03-01-2020          3     30  3.0  Pandama
3  04-01-2020          4     35  NaN      NaN

## Right Join

![right join](./img/right_join.png)

In [88]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,4],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          4     35

In [89]:
right_table = {'ID': [3],
              'Country': ['Pandama']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID  Country
0   3  Pandama

In [90]:
right_join= left_table_df.merge(right_table_df, left_on='CountryID', right_on='ID', how='right')

In [91]:
right_join

         Date  CountryID  Units  ID  Country
0  03-01-2020          3     30   3  Pandama

### Full Outer Join

![full join](./img/full_outer_join.png)

In [98]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020', '31-10,2022' ],
              'CountryID': [1,1,3,2,5],
              'Units': [40, 25, 30, 35,67]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35
4  31-10,2022          5     67

In [99]:
right_table = {'ID': [1,2,3,4],
              'Country': ['USA', 'Canada', 'Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   1     USA
1   2  Canada
2   3  Panama
3   4   Spain

In [100]:
outer_join = left_table_df.merge(right_table_df, left_on='CountryID', right_on='ID', how='outer').drop('ID', axis=1)

In [101]:
outer_join

         Date  CountryID  Units Country
0  01-01-2020        1.0   40.0     USA
1  02-01-2020        1.0   25.0     USA
2  04-01-2020        2.0   35.0  Canada
3  03-01-2020        3.0   30.0  Panama
4         NaN        NaN    NaN   Spain
5  31-10,2022        5.0   67.0     NaN

## Left Anti Join

![left anti](./img/left_anti_join.png)

In [102]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [103]:
right_table = {'ID': [3,4],
              'Country': ['Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   3  Panama
1   4   Spain

In [109]:
left_anti_join_df = left_table_df.merge(right_table_df,left_on="CountryID",right_on='ID',how='left', indicator=True).drop('ID', axis=1).query('_merge == "left_only"')

In [110]:
left_anti_join_df

         Date  CountryID  Units Country     _merge
0  01-01-2020          1     40     NaN  left_only
1  02-01-2020          1     25     NaN  left_only
3  04-01-2020          2     35     NaN  left_only

## Right Anti Join

![right anti join](./img/right_anti_join.png)

In [111]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [112]:
right_table = {'ID': [3,4],
              'Country': ['Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   3  Panama
1   4   Spain

In [129]:
right_anti_df = left_table_df.merge(right_table_df,left_on="CountryID", right_on="ID",how="right")

In [130]:
right_anti_df = right_anti_df[right_anti_df["CountryID"].isna()].drop(["CountryID", "Date", "Units"], axis=1)   # Method 1
right_anti_df

   ID Country
1   4   Spain

In [133]:
right_anti_join_df = left_table_df.merge(right_table_df,left_on="CountryID",right_on='ID',how='right', indicator=True).drop('ID', axis=1).query('_merge == "right_only"')
# MEthod 2

In [132]:
right_anti_join_df

  Date  CountryID  Units Country      _merge
1  NaN        NaN    NaN   Spain  right_only

In [146]:
right_anti_join_df = left_table_df.merge(right_table_df,
                                   left_on="CountryID",
                                   right_on='ID',
                                   how='right', indicator=True)

In [147]:
right_anti_join_df.loc[right_anti_join_df['_merge'] == 'right_only'].drop(["CountryID", "Date", "Units"], axis=1)   # Method 3

   ID Country      _merge
1   4   Spain  right_only

### Concatenation

In [148]:
left_anti_join_df

         Date  CountryID  Units Country     _merge
0  01-01-2020          1     40     NaN  left_only
1  02-01-2020          1     25     NaN  left_only
3  04-01-2020          2     35     NaN  left_only

In [149]:
right_anti_join_df

         Date  CountryID  Units  ID Country      _merge
0  03-01-2020        3.0   30.0   3  Panama        both
1         NaN        NaN    NaN   4   Spain  right_only

In [151]:
pd.concat([left_anti_join_df,right_anti_join_df],ignore_index= True)   #union

         Date  CountryID  Units Country      _merge   ID
0  01-01-2020        1.0   40.0     NaN   left_only  NaN
1  02-01-2020        1.0   25.0     NaN   left_only  NaN
2  04-01-2020        2.0   35.0     NaN   left_only  NaN
3  03-01-2020        3.0   30.0  Panama        both  3.0
4         NaN        NaN    NaN   Spain  right_only  4.0

## Task

In [153]:
employees = {
    'Emp_ID': range(1001, 1021),
    'Name': [
        'Ali', 'Sara', 'Umer', 'Hina', 'Bilal', 'Ayesha', 'Raza', 'Mona', 'Danish', 'Tuba',
        'Kashif', 'Iqra', 'Ahmed', 'Nida', 'Owais', 'Farah', 'Zain', 'Mehak', 'Haris', 'Amna'
    ],
    'Dept_ID': [101,102,103,104,105,101,102,103,104,105,101,102,103,104,105,101,102,103,104,105],
    'Salary': [
        70000, 82000, 60000, 90000, 75000, 71000, 88000, 64000, 94000, 77000,
        73000, 85000, 62000, 91000, 76000, 70500, 89500, 65000, 93000, 78000
    ],
    'Join_Year': [
        2018,2019,2020,2018,2017,2019,2018,2021,2022,2020,
        2017,2018,2019,2021,2022,2023,2019,2020,2021,2022
    ]
}

In [154]:
departments = {
    'Dept_ID': [101,102,103,104,105,106],
    'Dept_Name': ['HR','IT','Finance','Marketing','Sales','Operations'],
    'Manager': ['Faisal','Asma','Kamran','Tariq','Sadia','Hassan'],
    'Location': ['Lahore','Karachi','Islamabad','Lahore','Karachi','Faisalabad']
}

In [155]:
employee_df = pd.DataFrame(employees)
employee_df

    Emp_ID    Name  Dept_ID  Salary  Join_Year
0     1001     Ali      101   70000       2018
1     1002    Sara      102   82000       2019
2     1003    Umer      103   60000       2020
3     1004    Hina      104   90000       2018
4     1005   Bilal      105   75000       2017
5     1006  Ayesha      101   71000       2019
6     1007    Raza      102   88000       2018
7     1008    Mona      103   64000       2021
8     1009  Danish      104   94000       2022
9     1010    Tuba      105   77000       2020
10    1011  Kashif      101   73000       2017
11    1012    Iqra      102   85000       2018
12    1013   Ahmed      103   62000       2019
13    1014    Nida      104   91000       2021
14    1015   Owais      105   76000       2022
15    1016   Farah      101   70500       2023
16    1017    Zain      102   89500       2019
17    1018   Mehak      103   65000       2020
18    1019   Haris      104   93000       2021
19    1020    Amna      105   78000       2022

In [156]:
departments_df = pd.DataFrame(departments)
departments_df

   Dept_ID   Dept_Name Manager    Location
0      101          HR  Faisal      Lahore
1      102          IT    Asma     Karachi
2      103     Finance  Kamran   Islamabad
3      104   Marketing   Tariq      Lahore
4      105       Sales   Sadia     Karachi
5      106  Operations  Hassan  Faisalabad

## Inner Join

In [160]:
inner_join = employee_df.merge(departments_df, left_on='Dept_ID', right_on='Dept_ID', how="inner")
inner_join

    Emp_ID    Name  Dept_ID  Salary  Join_Year  Dept_Name Manager   Location
0     1001     Ali      101   70000       2018         HR  Faisal     Lahore
1     1002    Sara      102   82000       2019         IT    Asma    Karachi
2     1003    Umer      103   60000       2020    Finance  Kamran  Islamabad
3     1004    Hina      104   90000       2018  Marketing   Tariq     Lahore
4     1005   Bilal      105   75000       2017      Sales   Sadia    Karachi
5     1006  Ayesha      101   71000       2019         HR  Faisal     Lahore
6     1007    Raza      102   88000       2018         IT    Asma    Karachi
7     1008    Mona      103   64000       2021    Finance  Kamran  Islamabad
8     1009  Danish      104   94000       2022  Marketing   Tariq     Lahore
9     1010    Tuba      105   77000       2020      Sales   Sadia    Karachi
10    1011  Kashif      101   73000       2017         HR  Faisal     Lahore
11    1012    Iqra      102   85000       2018         IT    Asma    Karachi
12    1013   Ahmed      103   62000       2019    Finance  Kamran  Islamabad
13    1014    Nida      104   91000       2021  Marketing   Tariq     Lahore
14    1015   Owais      105   76000       2022      Sales   Sadia    Karachi
15    1016   Farah      101   70500       2023         HR  Faisal     Lahore
16    1017    Zain      102   89500       2019         IT    Asma    Karachi
17    1018   Mehak      103   65000       2020    Finance  Kamran  Islamabad
18    1019   Haris      104   93000       2021  Marketing   Tariq     Lahore
19    1020    Amna      105   78000       2022      Sales   Sadia    Karachi

### Left Join

In [161]:
left_join = employee_df.merge(departments_df, left_on='Dept_ID', right_on='Dept_ID', how="left")
left_join

    Emp_ID    Name  Dept_ID  Salary  Join_Year  Dept_Name Manager   Location
0     1001     Ali      101   70000       2018         HR  Faisal     Lahore
1     1002    Sara      102   82000       2019         IT    Asma    Karachi
2     1003    Umer      103   60000       2020    Finance  Kamran  Islamabad
3     1004    Hina      104   90000       2018  Marketing   Tariq     Lahore
4     1005   Bilal      105   75000       2017      Sales   Sadia    Karachi
5     1006  Ayesha      101   71000       2019         HR  Faisal     Lahore
6     1007    Raza      102   88000       2018         IT    Asma    Karachi
7     1008    Mona      103   64000       2021    Finance  Kamran  Islamabad
8     1009  Danish      104   94000       2022  Marketing   Tariq     Lahore
9     1010    Tuba      105   77000       2020      Sales   Sadia    Karachi
10    1011  Kashif      101   73000       2017         HR  Faisal     Lahore
11    1012    Iqra      102   85000       2018         IT    Asma    Karachi
12    1013   Ahmed      103   62000       2019    Finance  Kamran  Islamabad
13    1014    Nida      104   91000       2021  Marketing   Tariq     Lahore
14    1015   Owais      105   76000       2022      Sales   Sadia    Karachi
15    1016   Farah      101   70500       2023         HR  Faisal     Lahore
16    1017    Zain      102   89500       2019         IT    Asma    Karachi
17    1018   Mehak      103   65000       2020    Finance  Kamran  Islamabad
18    1019   Haris      104   93000       2021  Marketing   Tariq     Lahore
19    1020    Amna      105   78000       2022      Sales   Sadia    Karachi

In [162]:
#Right Join
right_join = employee_df.merge(departments_df, left_on='Dept_ID', right_on='Dept_ID', how="right")
right_join

,Emp_ID,Name,Dept_ID,Salary,Join_Year,Dept_Name,Manager,Location
0,1001.0,Ali,101,70000.0,2018.0,HR,Faisal,Lahore
1,1006.0,Ayesha,101,71000.0,2019.0,HR,Faisal,Lahore
2,1011.0,Kashif,101,73000.0,2017.0,HR,Faisal,Lahore
3,1016.0,Farah,101,70500.0,2023.0,HR,Faisal,Lahore
4,1002.0,Sara,102,82000.0,2019.0,IT,Asma,Karachi
5,1007.0,Raza,102,88000.0,2018.0,IT,Asma,Karachi
6,1012.0,Iqra,102,85000.0,2018.0,IT,Asma,Karachi
7,1017.0,Zain,102,89500.0,2019.0,IT,Asma,Karachi
8,1003.0,Umer,103,60000.0,2020.0,Finance,Kamran,Islamabad
9,1008.0,Mona,103,64000.0,2021.0,Finance,Kamran,Islamabad
10,1013.0,Ahmed,103,62000.0,2019.0,Finance,Kamran,Islamabad
11,1018.0,Mehak,103,65000.0,2020.0,Finance,Kamran,Islamabad
12,1004.0,Hina,104,90000.0,2018.0,Marketing,Tariq,Lahore
13,1009.0,Danish,104,94000.0,2022.0,Marketing,Tariq,Lahore
14,1014.0,Nida,104,91000.0,2021.0,Marketing,Tariq,Lahore
15,1019.0,Haris,104,93000.0,2021.0,Marketing,Tariq,Lahore
16,1005.0,Bilal,105,75000.0,2017.0,Sales,Sadia,Karachi
17,1010.0,Tuba,105,77000.0,2020.0,Sales,Sadia,Karachi
18,1015.0,Owais,105,76000.0,2022.0,Sales,Sadia,Karachi
19,1020.0,Amna,105,78000.0,2022.0,Sales,Sadia,Karachi
20,NaN,NaN,106,NaN,NaN,Operations,Hassan,Faisalabad

In [164]:
#Left Anti Join
left_anti_join_df = employee_df.merge(departments_df, left_on='Dept_ID', right_on='Dept_ID', how="left",indicator=True)
left_anti_join_df

,Emp_ID,Name,Dept_ID,Salary,Join_Year,Dept_Name,Manager,Location,_merge
0,1001,Ali,101,70000,2018,HR,Faisal,Lahore,both
1,1002,Sara,102,82000,2019,IT,Asma,Karachi,both
2,1003,Umer,103,60000,2020,Finance,Kamran,Islamabad,both
3,1004,Hina,104,90000,2018,Marketing,Tariq,Lahore,both
4,1005,Bilal,105,75000,2017,Sales,Sadia,Karachi,both
5,1006,Ayesha,101,71000,2019,HR,Faisal,Lahore,both
6,1007,Raza,102,88000,2018,IT,Asma,Karachi,both
7,1008,Mona,103,64000,2021,Finance,Kamran,Islamabad,both
8,1009,Danish,104,94000,2022,Marketing,Tariq,Lahore,both
9,1010,Tuba,105,77000,2020,Sales,Sadia,Karachi,both
10,1011,Kashif,101,73000,2017,HR,Faisal,Lahore,both
11,1012,Iqra,102,85000,2018,IT,Asma,Karachi,both
12,1013,Ahmed,103,62000,2019,Finance,Kamran,Islamabad,both
13,1014,Nida,104,91000,2021,Marketing,Tariq,Lahore,both
14,1015,Owais,105,76000,2022,Sales,Sadia,Karachi,both
15,1016,Farah,101,70500,2023,HR,Faisal,Lahore,both
16,1017,Zain,102,89500,2019,IT,Asma,Karachi,both
17,1018,Mehak,103,65000,2020,Finance,Kamran,Islamabad,both
18,1019,Haris,104,93000,2021,Marketing,Tariq,Lahore,both
19,1020,Amna,105,78000,2022,Sales,Sadia,Karachi,both